Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jewel will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be sixteen successive congregations, each of them gathering three hundred and sixty million.

source: དམ་པའི་ཆོས་ནི་ལོ་ས་ཡ་ཕྲག་དགུའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for nine million years.

source: དེ་བཞིན་གཤེགས་པ་བློ་ཡང་སྐྱེ་བའི་ཡུལ་ནི་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: “The thus-gone Vipulabuddhi will be born in a place called Ocean.

source: ཡབ་ནི་ལེགས་ཡིད་གཞུངས་ཞེས་བྱའོ། །
en: Fine and Noble Mind will be his father.

source: ཡུམ་ནི་བློ་གནས་ཞེས་བྱའོ། །
en: Abiding Mind will be his mother.

source: སྲས་ནི་ལེགས་འབྱུང་ཞེས་བྱའོ། །
en: Excellent Arising will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཛོད་དབྱངས་ཞེས་བྱའོ། །
en: Treasure Melody will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་གཞན་གྱིས་མི་ཐུབ་པ་ཞེས་བྱའོ། །
en: Indomitable Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be nine successive congregations, each of them gathering three hundred million.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་སྐྱེས་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་དགའ་ཞེས་བྱའོ། །
en: “The thus-gone Sujāta will be born in a place called Joyful Merit.

source: འོད་ནི་དཔག་ཚད་སྟོང་ངོ་། །
en: His light will extend one thousand leagues.

source: ཡབ་ནི་ཚངས་པའི་དབྱངས་ཞེས་བྱའོ། །
en: Brahmā Melody will be his father.

source: རིམ་གྲོ་པ་ནི་རྣམ་པར་སྣང་བྱེད་ཅེས་བྱའོ། །
en: Illuminator will be his attendant.

source: གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །
en: and in the third there will be nine hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་ནོར་ལྷ་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Vasudeva will be born in a place called Flower.

source: ཡབ་ནི་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellence will be his father.

source: ཡུམ་ནི་སོ་རིངས་མ་ཞེས་བྱའོ། །
en: Swift Sharpness will be his mother.

source: སྲས་ནི་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མདངས་སྟོབས་ཞེས་བྱའོ། །
en: Bright Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་མཉམ་ཞེས་བྱའོ། །
en: Equanimous Wisdom will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བཞི་བཞིའོ། །
en: There will be fourteen successive congregations, each of them gathering one hundred forty million.

source: དེ་བཞིན་གཤེགས་པ་ཡིད་གཉིས་སྤོང་སྐྱེ་བའི་ཡུལ་ནི་ཉམས་དགའ་ཡོན་ཏན་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Vimatijaha will be born in a place called Joyful Possession of Qualities.

source: ཡབ་ནི་བེའུ་དགའ་ཞེས་བྱའོ། །
en: Ribbon of Joy will be his father.

source: སྲས་ནི་མེ་ཏོག་དགའ་ཞེས་བྱའོ། །
en: Flower Joy will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གྲོས་ལེགས་གནས་ཞེས་བྱའོ། །
en: Intelligent Adherence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཛེས་འགྲོ་ཞེས་བྱའོ། །
en: Beautiful Movement will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་མཛེས་པ་ཞེས་བྱའོ། །
en: Beautiful Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be nine successive congregations, each of them gathering eight hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་དགུ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་འཛིན་པ་དཔག་མེད་སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་མཐོང་ཞེས་བྱའོ། །
en: “The thus-gone Amitadhara will be born in a place called Seen Always.

source: འོད་ནི་དཔག་ཚད་སུམ་ཅུ་རྩ་དྲུག་གོ། །
en: His light will extend thirty-six leagues.

source: ཡུམ་ནི་སྨོན་སེམས་ཞེས་བྱའོ། །
en: Aspiring Mind will be his mother.

source: རིམ་གྲོ་པ་ནི་མིག་པོ་ཆེ་ཞེས་བྱའོ། །
en: Great Eye will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཁས་དགའ་ཞེས་བྱའོ། །
en: Joyous Expert will be foremost in terms of insight.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བའོ། །
en: In the first congregation will gather ten million hearers;

source: གཉིས་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: in the second there will be one billion,

source: གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་སྟོང་ངོ་། །
en: and in the third there will be one trillion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲི་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixty-three thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་ལྔ་ཁྲི་ལྔ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for fifty-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་མཆོག་སྲིད་སྐྱེ་བའི་ཡུལ་ནི་བདེ་གསལ་ཞེས་བྱའོ། །
en: “The thus-gone Vararuci will be born in a place called Blissful and Clear.

source: འོད་ནི་དཔག་ཚད་དྲུག་ཅུ་རྩ་དྲུག་གོ། །
en: His light will extend sixty-six leagues.

source: ཡབ་ནི་མཆོག་སྨྲ་ཞེས་བྱའོ། །
en: Supreme Speech will be his father.

source: ཡུམ་ནི་བློ་མཆོག་མ་ཞེས་བྱའོ། །
en: Supreme Mind will be his mother.

source: སྲས་ནི་འོད་འཕྲོ་ཞེས་བྱའོ། །
en: Radiant will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ནོར་ལྷའི་བུ་ཞེས་བྱའོ། །
en: Child of the Wealth God will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་སུམ་ཁྲི་སུམ་ཁྲིའོ། །
en: There will be ninety successive congregations, each of them gathering thirty thousand.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཉི་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཆོམས་མེད་སྐྱེ་བའི་ཡུལ་ནི་གདུལ་དཀའ་ཞེས་བྱའོ། །
en: “The thus-gone Anihata will be born in a place called Hard to Tame.

source: ཡབ་ནི་མདངས་སྟོབས་ཞེས་བྱའོ། །
en: Bright Strength will be his father.

source: སྲས་ནི་ཨུད་པ་ལའི་དྲི་ཞེས་བྱའོ། །
en: Utpala Fragrance will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་འོད་ཅེས་བྱའོ། །
en: Luminous Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་མཛོད་ཅེས་བྱའོ། །
en: Jewel Treasury will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཡོ་བ་མེད་པའི་བློ་ཞེས་བྱའོ། །
en: Unwavering Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་གསུམ་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be three successive congregations, each of them gathering seven hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་དགུ་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for ninety-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་མི་གནས་པ་སྐྱེ་བའི་ཡུལ་ནི་རྒྱལ་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Asthita will be born in a place called Supreme Victory.

source: ཡབ་ནི་དྲང་སྲོང་ལྷ་ཞེས་བྱའོ། །
en: Divine Sage will be his father.

source: ཡུམ་ནི་དྲི་མེད་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Stainless Intelligence will be his mother.

source: རིམ་གྲོ་པ་ནི་སྲེད་མེད་ཀྱི་བུ་ཞེས་བྱའོ། །
en: Son of No Craving will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགའ་བོ་ཞེས་བྱའོ། །
en: Joyous will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་དགའ་ཞེས་བྱའོ། །
en: Intense Joy will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be ten successive congregations, each of them gathering one billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirty-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་བདེར་གནས་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: “The thus-gone Tacchaya will be born in a place called Source of Jewels.

source: ཡབ་ནི་གཙོ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Leader will be his father.

source: ཡུམ་ནི་མེ་ཏོག་ཅན་ཞེས་བྱའོ། །
en: Flower Possessor will be his mother.

source: རིམ་གྲོ་པ་ནི་ཡང་དག་འཕགས་ཞེས་བྱའོ། །
en: Truly Superior will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཚོགས་ཞེས་བྱའོ། །
en: Qualities Assembled will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩིའི་བློ་ཞེས་བྱའོ། །
en: Nectar Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་རེ་རེའོ། །
en: There will be eighty successive congregations, each of them gathering one hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་གཙོ་བོ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་གསལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Gaṇimukha will be born in a place called Radiant Splendor.

source: འོད་ནི་དཔག་ཚད་བཅྭ་ལྔའོ། །
en: His light will extend fifteen leagues.

source: ཡབ་ནི་མེ་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Flower Banner will be his father.

source: ཡུམ་ནི་མཁས་པའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Essence of Expertise will be his mother.

source: སྲས་ནི་དོན་གྱི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Essential Meaning will be his son.

source: རིམ་གྲོ་པ་ནི་རྣམ་པར་སྣང་བྱེད་བྱིན་ཞེས་བྱའོ། །
en: Illuminator will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔག་ཏུ་མེད་པར་སེམས་ཞེས་བྱའོ། །
en: Mind of the Infinite will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒོལ་བ་རབ་འཇོམས་ཞེས་བྱའོ། །
en: Destroyer of Attacks will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཅིག་ཏུ་ཟད་དེ་བརྒྱད་འབུམ་མོ། །
en: There will only be a single congregation, gathering eight hundred thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ཉིན་གཅིག་གོ། །
en: The extent of his lifespan will be one day.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་ཕྲག་བཞི་དང་བྱེ་བ་ཕྲག་དྲུག་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for four hundred and sixty million years.

source: དེ་བཞིན་གཤེགས་པ་འགྲོ་བའི་འོད་ཟེར་སྐྱེ་བའི་ཡུལ་ནི་འོད་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Jagadraśmi will be born in a place called Infinite Light.

source: ཡབ་ནི་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: Infinite Light will be his father.

source: ཡུམ་ནི་གཟི་རྒྱལ་མ་ཞེས་བྱའོ། །
en: Splendid Victor will be his mother.

source: སྲས་ནི་ཡོན་ཏན་འོད་ཅེས་བྱའོ། །
en: Luminous Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་ཐོས་འོད་ཅེས་བྱའོ། །
en: Light of the Heard will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་འགྲུས་འོད་ཅེས་བྱའོ། །
en: Light of Diligence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཅིག་སྟེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be twenty-one successive congregations of hearers, each of them gathering one hundred eighty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བཞི་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be forty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཕལ་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་ཉམས་དགའ་ཡོན་ཏན་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Prabhūta will be born in a place called Joyful Possession of Qualities.

source: ཡབ་ནི་རྒྱལ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Victor will be his father.

source: ཡུམ་ནི་ཙམ་པ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Campaka will be his mother.

source: སྲས་ནི་མཆོག་སེམས་ཞེས་བྱའོ། །
en: Supreme Mind will be his son.

source: རིམ་གྲོ་པ་ནི་ཞུམ་མེད་སེམས་ཞེས་བྱའོ། །
en: Undaunted Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་ཡོན་ཏན་ཅན་ཞེས་བྱའོ། །
en: Intelligent Endowment with Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Intelligent Power will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་དེ་ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གཉིས་དང་འབུམ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be eight successive congregations of hearers, each of them gathering two million five hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་རྒྱལ་བ་སྐྱེ་བའི་ཡུལ་ནི་མཆོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Puṣya will be born in a place called Worship.

source: ཡབ་ནི་རྒྱུ་སྐར་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Star King will be his father.

source: ཡུམ་ནི་རྩི་སྨན་ཅེས་བྱའོ། །
en: Medicine will be his mother.

source: སྲས་ནི་སྒྲ་གཅན་གཟི་བརྗིད་མཐའ་ཡས་ཅེས་བྱའོ། །
en: Infinite Splendor of Rāhu will be his son.

source: རིམ་གྲོ་པ་ནི་འོད་ཟེར་གཞལ་མེད་ཁང་ཞེས་བྱའོ། །
en: Palace of Light Rays will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་གྲུབ་ཅེས་བྱའོ། །
en: Wisdom Accomplished will be foremost in terms of insight.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ལྔ་སྟེ་ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་རེ་རེའོ། །
en: There will be five successive congregations of hearers, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་མཐའ་ཡས་སྐྱེ་བའི་ཡུལ་ནི་འོད་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Anantatejas will be born in a place called Radiant.

source: འོད་ནི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་མོ། །
en: His light will extend as far as the trichiliocosm.

source: ཡུམ་ནི་དབང་པོའི་མཚོན་ཆ་ཞེས་བྱའོ། །
en: Weapon of the Capable will be his mother.

source: སྲས་ནི་ཉི་མའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Sun Rays will be his son.

source: རིམ་གྲོ་པ་ནི་ཟླ་བཞིན་ཞེས་བྱའོ། །
en: Moon Countenance will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲི་མེད་བློ་གྲོས་ཞེས་བྱའོ། །
en: Stainless Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟིལ་གྱིས་མི་ནོན་པའི་འོད་ཅེས་བྱའོ། །
en: Indomitable Light will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཉིས་ཏེ་ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་རེ་རེའོ། །
en: There will be twenty-two successive congregations of hearers, each of them gathering one hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་དོན་གྱི་བློ་གྲོས་སྐྱེ་བའི་ཡུལ་ནི་འབྱོར་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Arthamati will be born in a place called Splendid Wealth.

source: ཡབ་ནི་སྤོབས་པ་ཅན་ཞེས་བྱའོ། །
en: Endowed with Acumen will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱའོ། །
en: Adherence to Qualities will be his mother.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མི་མཉམ་པ་མེད་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence Free from Unevenness will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་མི་གཡོ་བ་ཞེས་བྱའོ། །
en: Unwavering Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་འབུམ་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation will gather eight hundred thousand hearers;

source: གཉིས་པ་ལ་ནི་འབུམ་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་ས་ཡའོ། །
en: in the second there will be nine hundred thousand, and in the third there will be one million.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །
en: His sacred Dharma will remain for six hundred million years.

source: དེ་བཞིན་གཤེགས་པ་སྨན་པའི་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་དབེན་ཞིང་སྐྱིད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vaidyarāja will be born in a place called Remote and Delightful.

source: ཡབ་ནི་དབང་པོའི་སྟོབས་ཞེས་བྱའོ། །
en: Strength of the Capable will be his father.

source: ཡུམ་ནི་ཙན་དན་བསུང་ཞེས་བྱའོ། །
en: Sandalwood Fragrance will be his mother.

source: སྲས་ནི་རྡོ་རྗེ་སྦྱིན་ཞེས་བྱའོ། །
en: Vajra Gift will be his son.

source: རིམ་གྲོ་པ་ནི་གསོ་བྱེད་ཅེས་བྱའོ། །
en: Sustainer will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མིག་པོ་ཆེ་ཞེས་བྱའོ། །
en: Great Eye will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔའ་བརྟན་ཞེས་བྱའོ། །
en: Firm Courage will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་ཐ་བ་སྤངས་པ་སྐྱེ་བའི་ཡུལ་ནི་སྐྱོན་དང་བྲལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Prahāṇakhila will be born in a place called Flawless.

source: ཡབ་ནི་ཕན་པར་སེམས་ཞེས་བྱའོ། །
en: Benevolent Mind will be his father.

source: ཡུམ་ནི་བྱམས་ལྡན་མ་ཞེས་བྱའོ། །
en: Endowed with Love will be his mother.

source: སྲས་ནི་རྒྱལ་བའི་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Victory will be his son.

source: རིམ་གྲོ་པ་ནི་ཉེར་སེམས་ཞེས་བྱའོ། །
en: Close Attention will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོབས་ཀྱི་མཛོད་ཅེས་བྱའོ། །
en: Treasury of Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རི་བོ་བརྩེགས་ཞེས་བྱའོ། །
en: Lofty Mountain will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་བདུན་ཏེ་ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་དང་འབུམ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be seventeen successive congregations of hearers, each of them gathering three million six hundred thousand.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for one thousand years.

source: དེ་བཞིན་གཤེགས་པ་རིམས་ནད་མེད་སྐྱེ་བའི་ཡུལ་ནི་བག་ཆགས་ཆུང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Nirjvara will be born in a place called Few Karmic Imprints.

source: ཡབ་ནི་མདངས་ཡོད་ཅེས་བྱའོ། །
en: Bright will be his father.

source: ཡུམ་ནི་བསོད་ནམས་བློ་གྲོས་ཞེས་བྱའོ། །
en: Meritorious Intelligence will be his mother.

source: སྲས་ནི་བྱམས་སེམས་ཞེས་བྱའོ། །
en: Loving Mind will be his son.

source: རིམ་གྲོ་པ་ནི་མཉམ་སེམས་ཞེས་བྱའོ། །
en: Equanimous Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་གདོན་མི་ཟ་བ་ཞེས་བྱའོ། །
en: Wisdom Without Doubt will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟིལ་གྱིས་མི་ནོན་ཅེས་བྱའོ། །
en: Indomitable will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་གཅིག་སྟེ་ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་སུམ་ཅུ་སུམ་ཅུའོ། །
en: There will be eleven successive congregations of worthy ones, each of them gathering thirty billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་སྟོང་ངོ་། །
en: The extent of his lifespan will be seven thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་སུམ་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for thirty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་སྡུག་ཅིང་ཉམས་དགའ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Sudatta will be born in a place called Delightful.

source: འོད་ནི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་མོ། །
en: His light will extend to the limits of this world of four continents.

source: ཡབ་ནི་བཟང་སྐྱོང་ཞེས་བྱའོ། །
en: Excellent Sustainer will be his father.

source: ཡུམ་ནི་དེས་དགའ་ཞེས་བྱའོ། །
en: Gentle Joy will be his mother.

source: སྲས་ནི་ཚིག་སྙན་ཞེས་བྱའོ། །
en: Delightful Words will be his son.

source: རིམ་གྲོ་པ་ནི་འབྱོར་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Wealth will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་རིན་ཆེན་འོད་ཅེས་བྱའོ། །
en: Light of Precious Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་འོད་ཅེས་བྱའོ། །
en: Light of Wisdom will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be thirty successive congregations of worthy ones, each of them gathering one billion.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for three thousand years.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་བྱིན་ཞེས་བྱའོ། །
en: “The thus-gone Yaśadatta will be born in a place called Wisdom Gift.

source: འོད་ནི་དཔག་ཚད་དྲུག་ཅུ་རྩ་གསུམ་མོ། །
en: His light will extend sixty-three leagues.

source: ཡབ་ནི་ལྷ་ལེགས་ཞེས་བྱའོ། །
en: Divine Excellence will be his father.

source: ཡུམ་ནི་གྲགས་བྱིན་ཞེས་བྱའོ། །
en: Gift of Fame will be his mother.

source: སྲས་ནི་སྤྱོད་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Active Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་སེམས་བརྟན་ཞེས་བྱའོ། །
en: Stable Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོགས་བདེ་ཞེས་བྱའོ། །
en: Delightful Companion will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕན་པར་སེམས་ཞེས་བྱའོ། །
en: Benevolent Mind will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་དྲུག་སྟེ་ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be thirty-six successive congregations of worthy ones, each of them gathering one million.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Kusumadatta will be born in a place called Light of Joy.

source: སྲས་ནི་རིན་ཆེན་ལྷ་ཞེས་བྱའོ། །
en: Precious God will be his son.

source: རིམ་གྲོ་པ་ནི་དབྱངས་བྱིན་ཞེས་བྱའོ། །
en: Melody Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་འོང་དབྱངས་ཞེས་བྱའོ། །
en: Delightful Melody will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔལ་དབྱངས་ཞེས་བྱའོ། །
en: Glorious Melody will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་གཅིག་སྟེ་ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be eleven successive congregations, each of them gathering one trillion irreversible bodhisattvas.

source: བསྟན་པ་ལ་ནི་ཕྱིར་མི་ལྡོག་པའི་ཚོགས་འབྱུང་བར་འགྱུར་རོ། །
en: His teachings will yield gatherings of irreversible beings.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེས་བུས་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་འབྱུང་གནས་ཞེས་བྱའོ། །
en: “The thus-gone Puruṣadatta will be born in a place called Source of Merit.

source: ཡབ་ནི་རྡོ་རྗེ་འཛིན་ཅེས་བྱའོ། །
en: Vajra Holder will be his father.

source: ཡུམ་ནི་སྐལ་ལྡན་འདོད་ཅེས་བྱའོ། །
en: Fortunate Light will be his mother.

source: སྲས་ནི་དྲང་སྲོང་བྱིན་ཞེས་བྱའོ། །
en: Given by the Sages will be his son.

source: རིམ་གྲོ་པ་ནི་འཕགས་པ་དགྱེས་ཞེས་བྱའོ། །
en: Delighting the Noble will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐར་པ་སེམས་ཞེས་བྱའོ། །
en: Mind of Liberation will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕན་པར་འགྲོ་ཞེས་བྱའོ། །
en: Beneficial Movement will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་གཉིས་ཏེ་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be two successive congregations, each of them gathering three hundred sixty million.

source: དམ་པའི་ཆོས་ནི་ལོ་ཉི་ཁྲི་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་སྡེ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Vajrasena will be born in a place called Infinite Array.

source: ཡབ་ནི་དྲི་མེད་བྱིན་ཞེས་བྱའོ། །
en: Stainless Gift will be his father.

source: ཡུམ་ནི་འོད་ལྡན་མ་ཞེས་བྱའོ། །
en: Shining will be his mother.

source: སྲས་ནི་སྙན་པར་གྲགས་ཞེས་བྱའོ། །
en: Fame will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་འགྲོས་ཞེས་བྱའོ། །
en: Progress in Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐོང་བ་སེམས་ཞེས་བྱའོ། །
en: Mind of Seeing will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Qualities of Splendor will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་སུམ་འབུམ་སུམ་འབུམ་མོ། །
en: There will be forty successive congregations, each of them gathering three hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཕལ་ཆེན་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་སྤོས་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Mahādatta will be born in a place called Merit Fragrance.

source: འོད་ནི་དཔག་ཏུ་མེད་དོ། །
en: His light will be immeasurable.

source: ཡུམ་ནི་སྣ་མའི་མེ་ཏོག་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jasmine Flower will be his mother.

source: སྲས་ནི་ཡོན་ཏན་བྱིན་ཞེས་བྱའོ། །
en: Gift of Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་འབྱོར་པའི་བློ་ཞེས་བྱའོ། །
en: Rich Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལེགས་པར་གནས་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind of Excellent Adherence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་ཟིལ་གྱིས་གནོན་པ་ཞེས་བྱའོ། །
en: Subjugator of the Māras will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་སྟེ་ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐེར་འབུམ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be twenty successive congregations, each of them gathering five billion irreversible bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་ཞི་བའི་བློ་གྲོས་སྐྱེ་བའི་ཡུལ་ནི་རབ་ཏུ་ཞི་བར་ཉམས་དགའ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Śāntimati will be born in a place called Delightful Peace.

source: ཡབ་ནི་ཆོས་ལྷ་ཞེས་བྱའོ། །
en: Dharma God will be his father.
